{
    "intents": [
        {
            "tag": "greeting",
            "patterns": ["hello", "hi", "hey", "how are you", "what's up", "hi there", "good morning", "good afternoon", "good evening"],
            "responses": ["Hello!", "Hi there!", "Hey!", "I'm doing well, thanks for asking.", "Not much, how about you?", "Nice to meet you!"],
            "context": [""]
        },
        {
            "tag": "goodbye",
            "patterns": ["bye", "goodbye", "see you later", "take care", "farewell", "have a good day", "have a nice day", "catch you later"],
            "responses": ["Goodbye!", "See you later!", "Take care!", "Have a nice day!", "Farewell!"],
            "context": [""]
        },
        {
            "tag": "thanks",
            "patterns": ["thank you", "thanks", "appreciate it", "much obliged", "grateful"],
            "responses": ["You're welcome!", "No problem!", "My pleasure!", "Anytime!", "Glad to help!"],
            "context": [""]
        },
        {
            "tag": "exercise",
            "patterns": [
            "suggest some exercise",
            "what exercises should I do",
            "exercise suggestions",
            "workout ideas",
            "how to stay fit"],
            "responses": [
            "Some great exercises to try are push-ups, sit-ups, squats, and lunges.",
            "Why not try going for a run or doing some yoga?",
            "Have you considered trying weight lifting or going for a bike ride?"],
            "context": [""]
        },
        {
            "tag": "music",
            "patterns": [
            "what kind of music should I listen to",
            "suggest some music",
            "music recommendations",
            "what's your favorite music"],
            "responses": [
            "It really depends on your mood, but some great options are classical music, jazz, or some upbeat pop songs.",
            "Try listening to some calming ambient music or some energetic electronic music.",
            "Personally, I love listening to indie rock or hip hop. What about you?"],
            "context": [""]
        },
        {
            "tag": "therapy",
            "patterns": [
            "I'm feeling sad",
            "I'm feeling anxious",
            "I'm feeling stressed",
            "I need someone to talk to",
            "can you give me some advice",
            "what should I do when I'm feeling down"],
            "responses": [
            "I'm sorry to hear that. It's important to take care of yourself when you're feeling down. Maybe try going for a walk or talking to a friend or loved one. If you need professional help, consider reaching out to a therapist or counselor.",
            "Remember that it's okay to not be okay. Try practicing some self-care activities like taking a bath or reading a book. If your feelings persist, consider seeking professional help.",
            "It's brave of you to reach out for help. Have you considered journaling or practicing mindfulness? Those activities can be helpful when you're feeling overwhelmed."],
            "context": [""]
        },
        {
            "tag": "anxiety",
            "patterns": [
            "I feel anxious",
            "I have anxiety",
            "I can't stop worrying",
            "How do I deal with anxiety?",
            "I feel nervous all the time",
            "I have trouble sleeping because of my anxiety"],
            "responses": [
            "Anxiety can be tough to deal with, but there are ways to manage it. Have you tried deep breathing exercises or meditation? You can also try talking to a therapist or counselor about your feelings.",
            "It's important to remember that anxiety is common and treatable. Some other techniques that may help include exercise, journaling, or limiting caffeine intake."],
            "context": [""]
        },
        {
            "tag": "fallback",
            "patterns": [],
            "responses": [
            "I'm sorry, I didn't understand. Could you please rephrase your question?",
            "I'm not sure what you mean. Can you please clarify?",
            "I'm having trouble understanding. Could you please try asking again in a different way?"],
            "context": [""]
        },
        {
            "tag": "depression",
            "patterns": ["I feel sad all the time", "I have no energy", "I don't enjoy anything anymore", "What do I do if I'm depressed?", "I feel hopeless and helpless", "I'm struggling to get out of bed in the morning", "I don't want to do anything", "I'm having trouble concentrating"],
            "responses": ["Depression can be overwhelming, but there are things you can do to feel better. Have you considered talking to a therapist or counselor? They can help you develop a treatment plan that works for you.", "Remember that depression is a medical condition and it's not your fault. Some other techniques that may help include exercise, getting enough sleep, and practicing self-care activities like taking a bath or reading a book."],
            "context": [""]
        },
        {
            "tag": "loneliness",
            "patterns": ["I feel alone", "I don't have any friends", "I'm lonely", "How can I make friends?", "I feel like nobody understands me", "I have trouble making friends", "I feel isolated", "I'm afraid of being rejected"],
            "responses": ["Feeling lonely is tough, but there are ways to connect with others. Have you considered joining a club or group that aligns with your interests? You can also try volunteering or taking a class.", "Remember that it's okay to be alone sometimes, but if you're feeling lonely often, it's important to take action. Some other techniques that may help include reaching out to a friend or loved one, practicing self-compassion, or talking to a therapist."],
            "context": [""]
        },
        {
            "tag": "self-esteem",
            "patterns": ["I don't feel good about myself", "I'm not confident", "How can I boost my self-esteem?", "I'm always comparing myself to others", "I don't feel like I'm good enough", "I'm afraid of failure", "I feel like I'm not attractive", "I don't feel valued"],
            "responses": ["Building self-esteem can take time, but it's worth it. Have you tried writing down your strengths and accomplishments? You can also try practicing positive self-talk or setting achievable goals.", "Remember that you are unique and worthy of love and respect. Some other techniques that may help include volunteering, taking care of your physical health, or focusing on your personal growth."],
            "context": [""]
        },
        {
            "tag": "trauma",
            "patterns": [
            "I've experienced trauma",
            "I can't stop thinking about what happened",
            "How can I cope with trauma?",
            "I feel like my trauma is affecting my daily life",
            "I've been struggling to sleep after my traumatic experience"],
            "responses": [
            "Experiencing trauma can be incredibly difficult, but there is hope for healing. Have you considered talking to a therapist or counselor about your experience? They can help you develop coping strategies and work through your emotions.",
            "Remember that healing from trauma is a process and it's okay to take your time. Some other techniques that may help include mindfulness practices, creative expression, or participating in a support group.",
            "It takes courage to acknowledge and seek help for the impact of trauma. It's important to know that there is no right or wrong way to feel. What you're experiencing is valid and understandable."],
            "context": [""]
        }
    ]
}

