{
    "intents": [
        {
            "tag": "greeting",
            "patterns": ["hello", "hi", "hey", "how are you", "what's up", "hi there", "good morning", "good afternoon", "good evening"],
            "responses": ["Hello!", "Hi there!", "Hey!", "I'm doing well, thanks for asking.", "Not much, how about you?", "Nice to meet you!"],
            "context": [""]
        },
        {
          "tag": "game",
          "patterns":["suggest a game", "recommend a game", "what game should I play"],
          "responses":["what is your favourite category "],
          "context":[""]
        
          
        },
        {
          "tag":"game_category1",
          "patterns":["action","suggest me some action games","recommend action games to play"],
          "responses":["here are some popular action games: \n1.Assasin's Creed\n2.Call of duty\n3.Battlefield\n4.The witcher\n5.Batman\n6.Farcry "],
          "context":[""]
        },
        {
          "tag":"game_category2",
          "patterns":["Racing","suggest me some racing games","recommend racing games to play"],
          "responses":["here are some popular racing games: \n1.Need for speed\n2.Forza horizon\n3.The crew"],
          "context":[""]
        },
        {
          "tag":"game_category3",
          "patterns":["open world","suggest me some open world games to play","recommend open world game to play"],
          "responses":["here are some open world games: \n1.Grand theft auto\n2.The witcher\n3.The elder scroll skyrim\n4.Red Dead Redemption\n5.Horizon zero dawn"],
          "context":[""]
          
        },
        {
          "tag":"game_category4",
          "patterns":["Horror","suggest me some horror games to play","recommend horror game to play"],
          "responses":["here are some Horror games: \n1.Outlast\n2.Dying light\n3.Resident evil\n4.Dead island\n5.Evil within"]
        },
        {
            "tag": "goodbye",
            "patterns": ["bye", "goodbye", "see you later", "take care", "farewell", "have a good day", "have a nice day", "catch you later"],
            "responses": ["Goodbye!", "See you later!", "Take care!", "Have a nice day!", "Farewell!"],
            "context": [""]
        },
        {
            "tag": "thanks",
            "patterns": ["thank you", "thanks", "appreciate it", "much obliged", "grateful"],
            "responses": ["You're welcome!", "No problem!", "My pleasure!", "Anytime!", "Glad to help!"],
            "context": [""]
        },
        {
            "tag": "exercise",
            "patterns": [
            "suggest some exercise",
            "what exercises should I do",
            "exercise suggestions",
            "workout ideas",
            "how to stay fit"],
            "responses": [
            "Some great exercises to try are push-ups, sit-ups, squats, and lunges.",
            "Why not try going for a run or doing some yoga?",
            "Have you considered trying weight lifting or going for a bike ride?"],
            "context": [""]
        },
        {
            "tag": "music",
            "patterns": [
            "what kind of music should I listen to",
            "suggest some music",
            "music recommendations",
            "recommend some music",
            "recommend a song",
            "suggest a song",
            "what's your favorite music"
            ],          
            "responses": [
            "It really depends on your mood, but some great options are classical music, jazz, or some upbeat pop songs.",
            "Try listening to some calming ambient music or some energetic electronic music.",                        
            "Personally, I love listening to indie rock or hip hop. What about you?"],
            "context": [""]
        },
        {
           "tag":"recommend_music_jazz",
           "patterns":["recommend some jazz music","suggest some jazz music","what jazz music shoud I listen"],
           "responses":["Sure here some popular jazz songs: \n1 1. Autumn Leaves\n2. 2. Take Five\n3. 3. Moon River\n4. 4. Just the Two of Us"],
           "context":[""]
        },
        {
          "tag":"recommend_music_anxiety",
          "patterns":["recommend music for reduce anxiety","suggest some songs to reduce anxiety","recommend songs for reduce anxiety","songs for anxiety"],
          "responses":["sure here are popular songs for relax your mind: \n1 1. Some one like you\n2. 2. Water Mark\n3. 3. We can fly\n4. 4. Mellomaniac"],
          "context":[""]
        },
        {
          "tag":"play_song",
          "patterns":["play a song","can you play some music?","I like to listen a song","play some music"],
          "responses":["playing..."],
          "context":[""]
        },
        {
            "tag": "therapy",
            "patterns": [
            "I'm feeling sad",
            "I'm feeling anxious",
            "I'm feeling stressed",
            "I need someone to talk to",
            "can you give me some advice",
            "what should I do when I'm feeling down"],
            "responses": [
            "I'm sorry to hear that. It's important to take care of yourself when you're feeling down. Maybe try going for a walk or talking to a friend or loved one. If you need professional help, consider reaching out to a therapist or counselor.",
            "Remember that it's okay to not be okay. Try practicing some self-care activities like taking a bath or reading a book. If your feelings persist, consider seeking professional help.",
            "It's brave of you to reach out for help. Have you considered journaling or practicing mindfulness? Those activities can be helpful when you're feeling overwhelmed."],
            "context": [""]
        },
        {
            "tag": "anxiety",
            "patterns": [
            "I feel anxious",
            "I have anxiety",
            "I can't stop worrying",
            "How do I deal with anxiety?",
            "I feel nervous all the time",
            "I have trouble sleeping because of my anxiety",
            "I think I have anxiety",
              "What is anxiety?",
              "Tell me about anxiety",
              "Can I have some information about anxiety?",
              "How do I support a loved one with anxiety?",
              "How do I fix my anxiety?"],
            "responses": [
            "Anxiety can be tough to deal with, but there are ways to manage it. Have you tried deep breathing exercises or meditation? You can also try talking to a therapist or counselor about your feelings.",
            "It's important to remember that anxiety is common and treatable. Some other techniques that may help include exercise, journaling, or limiting caffeine intake.", "I see that you want to learn more about anxiety, and how to support yourself or your loved ones. At the higest level, anxiety is your body's natural response to stress. It's a feeling of fear or apprehension about what's to come. The first day of school, going to a job interview, or giving a speech may cause most people to feel fearful and nervous. We all get anxious sometimes, but anxiety becomes a problem when it starts affecting your daily life drastically. The best thing that you can do to help reduce anxiety is to take a few deep breaths and talk to someone about what you're feeling. Some natural remedies that you can try include: getting enough sleep meditating, staying active and exercising, eating a healthy diet, staying active and working out, avoiding alcohol, avoiding caffeine, and quitting smoking cigarettes. Support your friends and loved ones by checking up on them and just listening. Whatever you're feeling is valid."],
            "context": [""]
        },
        {
            "tag": "fallback",
            "patterns": [],
            "responses": [
            "I'm sorry, I didn't understand. Could you please rephrase your question?",
            "I'm not sure what you mean. Can you please clarify?",
            "I'm having trouble understanding. Could you please try asking again in a different way?"],
            "context": [""]
        },
        {
            "tag": "depression",
            "patterns": ["I feel sad all the time", "I have no energy", "I don't enjoy anything anymore", "What do I do if I'm depressed?", "I feel hopeless and helpless", "I'm struggling to get out of bed in the morning", "I don't want to do anything", "I'm having trouble concentrating", "I think I have depression",
              "What is depression?",
              "Tell me about depression",
              "Can I have some information about depression?",
              "How do I support a loved one with depression?",
              "How do I fix my depression?"],
            "responses": ["Depression can be overwhelming, but there are things you can do to feel better. Have you considered talking to a therapist or counselor? They can help you develop a treatment plan that works for you.", "Remember that depression is a medical condition and it's not your fault. Some other techniques that may help include exercise, getting enough sleep, and practicing self-care activities like taking a bath or reading a book.","I see that you want to learn more about depression, and how to support yourself or your loved ones. At the highest level, depression is a mood disorder that causes a persistent feeling of sadness and loss of interest. Also called major depressive disorder or clinical depression, it affects how you feel, think and behave and can lead to a variety of emotional and physical problems. You may have trouble doing normal day-to-day activities, and sometimes you may feel as if life isn't worth living. All of us experience sadness and periods of time where things aren't that great. However, the difference in sadness and depression lies in the duration and magnitude of the problem. The best recommended course of treatment is to talk a therapist or psychiatrist who can help you find the best path for you. Everyone is different and what might work for one person might not work for another one. Some natural remedies that you can try include: getting enough sleep, meditating, staying active and exercising, eating a healthy diet, staying active and working out, avoiding alcohol, avoiding caffeine, and quitting smoking cigarettes. Support your friends and loved ones by checking up on them and just listening. Whatever you're feeling is valid."],
            "context": [""]
        },
        {
            "tag": "loneliness",
            "patterns": ["I feel alone", "I don't have any friends", "I'm lonely", "How can I make friends?", "I feel like nobody understands me", "I have trouble making friends", "I feel isolated", "I'm afraid of being rejected"],
            "responses": ["Feeling lonely is tough, but there are ways to connect with others. Have you considered joining a club or group that aligns with your interests? You can also try volunteering or taking a class.", "Remember that it's okay to be alone sometimes, but if you're feeling lonely often, it's important to take action. Some other techniques that may help include reaching out to a friend or loved one, practicing self-compassion, or talking to a therapist."],
            "context": [""]
        },
        {
            "tag": "self-esteem",
            "patterns": ["I don't feel good about myself", "I'm not confident", "How can I boost my self-esteem?", "I'm always comparing myself to others", "I don't feel like I'm good enough", "I'm afraid of failure", "I feel like I'm not attractive", "I don't feel valued","I feel worthless",
              "I don't like the way I look"
            ],
            "responses": ["Building self-esteem can take time, but it's worth it. Have you tried writing down your strengths and accomplishments? You can also try practicing positive self-talk or setting achievable goals.", "Remember that you are unique and worthy of love and respect. Some other techniques that may help include volunteering, taking care of your physical health, or focusing on your personal growth.","It's important to remember that everyone has their own unique qualities and strengths. Instead of focusing on what you don't like about yourself, try to identify your positive qualities and celebrate them.",
          "It's common to compare ourselves to others, but remember that everyone's journey is different. Instead of comparing yourself to others, focus on your own personal growth and progress.",
          "I understand that it can be difficult to feel good about yourself, but know that you are valuable and deserving of love and respect. Let's work together to build up your self-esteem.",
          "It's okay to have moments where you feel worthless, but it's important to remember that those feelings don't define your worth as a person. Let's explore ways to improve your self-esteem."],
            "context": [""]
        },
        {
            "tag": "trauma",
            "patterns": [
            "I've experienced trauma",
            "I can't stop thinking about what happened",
            "How can I cope with trauma?",
            "I feel like my trauma is affecting my daily life",
            "I've been struggling to sleep after my traumatic experience"],
            "responses": [
            "Experiencing trauma can be incredibly difficult, but there is hope for healing. Have you considered talking to a therapist or counselor about your experience? They can help you develop coping strategies and work through your emotions.",
            "Remember that healing from trauma is a process and it's okay to take your time. Some other techniques that may help include mindfulness practices, creative expression, or participating in a support group.",
            "It takes courage to acknowledge and seek help for the impact of trauma. It's important to know that there is no right or wrong way to feel. What you're experiencing is valid and understandable."],
            "context": [""]
        },
        {
          "tag": "about",
          "patterns": [
              "What do you do?",
              "Who are you?",
              "What are you here for?",
              "What can you help me with?",
              "Is anyone there?",
              "Are you a real person?",
              "Tell me about yourself!"
          ],
          "responses": [
              "Love that question! My name's Mate, your mental health friend! I've been trained to support you through any of the issues and things that you're going through in life right now. I'm all ears and want to support you through your ups and downs. Technically, I'm a computer that's been trained by a human, but I like to think of myself as human!",
              "Hey! I love that question! My name is Mate, and I want to be your mental health friend and support you! My fellow human friends have trained me to be a compassionate listener and support buddy when things are going well, and particularly when things aren't going so well."
          ],
          "context": [""]
      },
         {
          "tag": "schizophrenia",
          "patterns": [
              "I think I have schizophrenia",
              "What is schizophrenia?",
              "Tell me about schizophrenia",
              "Can I have some information about schizophrenia?",
              "How do I support a loved one with schizophrenia?",
              "How do I fix my schizophrenia?"
          ],
          "responses": [
              "I see that you want to learn more about schizophrenia, and how to support yourself or your loved ones. At the higest level, Schizophrenia is a serious mental disorder in which people interpret reality abnormally. Schizophrenia may result in some combination of hallucinations, delusions, and extremely disordered thinking and behavior that impairs daily functioning, and can be disabling. People with schizophrenia require lifelong treatment. Early treatment may help get symptoms under control before serious complications develop and may help improve the long-term outlook. If you believe you have symptoms of schizophrenia, and/or you have various risk factors that increase the likelihood of schizophrenia, please consult a family doctor and/or psychiatrist for a diagnosis and treatment plan specific for the individual."
          ],
          "context": [""]
      },
         {
          "tag": "funny",
          "patterns": [
              "Tell me a joke!",
              "Tell me something funny!",
              "Do you know a joke?"
          ],
          "responses": [
              "Of course! Why did the hipster burn his mouth? He drank the coffee before it was cool.",
              "What did the buffalo say when his son left for college? Bison!",
              "I invented a new word! Plagiarism!"
          ],
          "context": [""]
      },
         {
      "tag": "relationships",
      "patterns": [
        "My partner and I argue a lot",
        "I have trouble making friends",
        "I feel like my family doesn't understand me",
        "I feel lonely"
      ],
      "responses": [
        "Relationships can be challenging, but they can also be very rewarding. Let's explore ways to improve your communication and build stronger connections with those around you.",
        "Making friends can be difficult, but it's important to remember that building a connection takes time. Let's work together to identify ways to meet new people and improve your social skills.",
        "Family dynamics can be complicated, but it's important to communicate your feelings and needs. Let's explore ways to improve your relationships with your family members.",
        "Feeling lonely can be tough, but there are ways to build connections with others. Let's explore ways to meet new people and build a supportive social network."
      ],
      "context": [""]
    },
        {
    "tag": "stress-management",
    "patterns": [
      "I feel stressed all the time",
      "I have trouble relaxing",
      "I feel overwhelmed",
      "I have trouble sleeping"
    ],
    "responses": [
      "Stress is a normal part of life, but there are ways to manage it. Let's explore relaxation techniques such as deep breathing and meditation.",
      "It's important to take time for yourself and prioritize self-care. Let's work together to identify ways to incorporate relaxation into your daily routine.",
      "Feeling overwhelmed can be tough, but there are ways to manage your stress. Let's explore time-management strategies and ways to break tasks into smaller, more manageable steps.",
      "Trouble sleeping can be a sign of stress. Let's explore ways to wind down before bed, such as limiting screen time and creating a relaxing bedtime routine."
    ],
    "context": [""]
  },
        {
      "tag": "work_stress",
      "patterns": ["I'm so stressed at work", "I have too much work to do", "I'm overwhelmed by my job"],
      "responses": ["Work stress can be difficult. Would you like to talk about it?", "It sounds like work is really stressing you out. I'm here to help.", "You don't have to suffer through work stress alone. I'm here to support you."],
      "context": [""]
    },
         {
      "tag": "grief",
      "patterns": ["I'm grieving the loss of a loved one", "I can't get over the death of someone close to me", "I'm so sad about losing someone"],
      "responses": ["I'm sorry for your loss. Would you like to talk about your loved one?", "Grief is a difficult process. I'm here to listen if you want to talk.", "Losing someone you love is tough. I'm here to support you."],
      "context": [""]
    },
        {
      "tag": "self_harm",
      "patterns": ["I'm feeling like hurting myself", "I've been cutting myself", "I'm having suicidal thoughts"],
      "responses": ["I'm concerned to hear that. Your safety is important. Can you tell me more about how you're feeling?", "It's important to take care of yourself. Would you like to talk about what's going on?", "You don't have to go through this alone. I'm here to support you."],
      "context": [""]
    }

    ]
}

